/*تمرین : دلیل خروجی [] == ![] چیست؟*/
/*پاسخ : در جاوا اسکریپت مفهوم truthy و falsy  وجود دارد که falsy ها شامل 8 مورد می‌شوند و هرچیزی جز آن ها 
truthy محصوب میشود در نتیجه مقدار [] برابر با true است و به دلیل وجود نقیض این مقدار برابر با false می شود
[] = true
![] = false
[] == false
 و زمانی که در مقایسه یک طرف قیاس مقدار دودویی باشد جاوا اسکریپت آن را به عدد تبدیل میکند در نتیجه  
[]==0
مقدار آرایه خالی نیز برابر با صفر است در نتیجه 
0==0
output = true
*/

/************************************************************************************************************/
/*تمرین 7: خروجی کد زیر چیست؟*/
/*for (var i = 10; i > 0; i++) {
    if (i == 5) {
        break;
    }
    console.log(i);
}*/
/*
پاسح: در این قطعه کد شرط به درستی اعمال نشده و هیچوقت شرط موجود در for و if میت نمی شود و این for به یک لوپ بی نهایت
تبدیل می شود. طبق شرط موجود در for چون شمارنده همواره اضافه می‌شود و مقدار اولیه برابر با 10 و بزرگتر از شرط if است
هیچگاه forبه پایان نرسیده و تبدیل به یک لوپ بینهایت می شود
*/

/***********************************************************************************************************/
/*تمرین 8: چه تغییری  باید در کد زیر بدهیم تا فقط اعداد زوج را نمایش دهد؟

 for (var i = 1; i <= 10; i++) {
       console.log(i);
   }

   پاسخ: می بایست شرط باقیمانده را به بخش کنسول اشافه کنیم. در واقع باید تمامی اعداد را به مد 2 محاسبه کرده
   و اگر باقیمانده صفر بود آن را چاپ کنیم:*/

    for (var i = 1; i <= 10; i++) {
        if(i%2===0){
            console.log(i);
        }    
   }

/***********************************************************************************************************/
   /*تمرین : مقدار متغیر count و i پس از اجرای قطعه کد زیرچیست؟*/
   var count = 0;
   for (var i = 1; i <= 3; i++) {
       count += i;
   }
   console.log(count); // count = 6
   console.log(i);  // i = 4
/*پاسخ: محاسبه ای که در for وجود دارد را میتوتن به شکل زیر ساده سازی نمود 
count = count + i
و محاسیه به شکل زیر برای آن انجام می شود:
(i=1) => count = 0+1 = 1
(i=2) => count = 1+2 = 3
(i=3) => count = 3+3 = 6
و مقدار i++  شده و در نهایت مقدار 4 را برمیگرداند و در شرط for رد می شود 
*/

/***********************************************************************************************************/
/*تمرین 10: خروجی قطعه کد زیر چیست ؟*/
var a = false || (true && false) || true || "Ali" || 0;
console.log(a); // true
/*پاسخ: میتوان قطعه کد بالا را به شکل زیر ساده کرد:
var a = false || false || true || "Ali" || 0;
برای خروجی این کد ما به دنبال truthy هستیم و چون ارتباط بین بخش های مختلف از نوع || می باشد
پس پس از اینکه اولین بار به truthy رسیدیم مابقی بخش ها را بررسی نمیکنیم
false = falsy
false = falsy
true = truthy
"Ali" = بررسی نمی شود
0 = بررسی نمی شود
*/

/***********************************************************************************************************/
/*تمرین 11: خروجی قطعه کد زیر چیست؟*/
var num = 1;
   while (num < 50) {
       num *= 2;
   }
   console.log(num); // 64
   /*در لوپ while تا زمانی که شرط برقرار باشد عملیات انجام مبشود و برای قطعه کد بالا محاسبات به شکل زیر است
   (num = 1) => num = 1*2 = 2
   (num = 2) => num = 2*2 = 4
   (num = 4) => num = 4*2 = 8
   (num = 8) => num = 8*2 = 16
   (num = 16) => num = 16*2 = 32
   (num = 32) => num = 32*2 = 64
   (num = 64)
   */

/***********************************************************************************************************/
/*تمرین ۱۲: برنامه‌ای بنویس که مجموع اعداد فرد بین ۱ تا ۲۰ را محاسبه کند.*/
var sum = 0;
for(var i = 0 ; i <=20 ; i++){
    if(i%2 == 1){
        sum += i;
    }
}
console.log("Sum of odds is: " + sum); //100

/***********************************************************************************************************/
/*تمرین ۱۳: آرایه ای از اعداد بسازید و  کدی بنویسید که مجموع المان های آرایه را حساب کند.*/
var array = [10,20,30,40,50,60,70,80,90];
var sumElemnts = 0;
for (const element of array) {
    sumElemnts += element;
}
console.log("sum of elements: " + sumElemnts); //450

/***********************************************************************************************************/
/*تمرین ۱۴: با استفاده از switch case، تابعی بنویسید که عدد ۱ تا ۷ را دریافت کند
 و نام روز هفته (مثلاً ۱ = "شنبه") را برگرداند. اگر عدد خارج از این بازه بود، "Invalid" برگرداند.*/
 function getDay(day){
    switch(day) {
        case 1:
            return "شنبه";
        case 2:
            return "یکشنبه";
        case 3:
            return "دوشنبه";
        case 4:
            return "سه‌شنبه";
        case 5:
            return "چهارشنبه";
        case 6:
            return "پنجشنبه";
        case 7:
            return "جمعه";
        default:
            return "Invalid";
    }
 }

console.log(getDay(1)); //شنبه
console.log(getDay(55)); //Invalid

/***********************************************************************************************************/
/*تمرین ۱۵: یک متغیر رشته ای  بسازید و کدی بنوسید که تعداد حروف صدادار (a, e, i, o, u) در آن را بشمارد.*/
var str = "iterating through each character of the string and checking if each character is a vowel";
var vowelSum = 0;
for (const element of str) {
    if(element === "a" || element === "e" || element === "i" || element === "o" || element === "u"){
        vowelSum ++;
    }
}
console.log(vowelSum);

/***********************************************************************************************************/
/*تمرین ۱۶: کدی بنویسید که با استفاده از حلقه for و دستورات شرطی، یک الگوی هرمی از ستاره‌ها (*) مانند زیر چاپ کند:

        *
       ***
      *****
*/

for(var i = 1 ; i <=3 ; i++){
    
    let line = ""; 

    for (let j = 1; j <= 3 - i; j++) {
        line += " ";
    }

    for (let k = 1; k <= 2 * i - 1; k++) {
        line += "*";
    }

    console.log(line);
}

/***********************************************************************************************************/
/*تمرین ۱۷: برنامه‌ای که معکوس یک عدد را چاپ کند. مثلاً اگر ورودی 1234 باشد، خروجی 4321 شود.*/
var originalNum = 1234; 
let reversed = 0;

while (originalNum > 0) {
    let lastDigit = originalNum % 10; 
    reversed = (reversed * 10) + lastDigit;
    originalNum = (originalNum - lastDigit) / 10; 
}

console.log(reversed)

/***********************************************************************************************************/
/*تمرین ۱۸: برنامه‌ای بنویس که اعداد اول بین ۱ تا ۱۰۰ را نمایش دهد.*/

for(var i = 1 ; i <= 100 ; i++){
    if(i > 1){
        for(var j = 2 ; j <= 9 ; j++){
            if(i == 2){
                console.log(i)
            }
            else{
                if(i % j == 0){
                    break;
                }
                else if(i < 9 || j == 9){
                    console.log(i);
                }
                else{
    
                }
            }            
        }
    }
}

/***********************************************************************************************************/
/*تمرین ۱۹: برنامه‌ای که عدد فاکتوریل یک عدد را حساب کند (مثلاً !5 = 5 × 4 × 3 × 2 × 1).*/
var num = 5; 
var factorial = 1;

for (var i = 1; i <= num; i++) {
    factorial *= i; 
}

console.log(factorial); //120